export default function safeString(string){
	map.forEach((value, key) => {
		string = string.replace(value, key);
	});
	return string;
}

let map = new Map([
	['M', 'М'],
	['y', 'у'],
	['H', 'Н'],
	['B', 'В'],
	['P', 'Р'],
	['O', 'О'],
	['E', 'Е'],
	['K', 'К'],
	['T', 'Т'],
	['A', 'А'],
	['C', 'С'],
	['X', 'Х'],
	['c', 'с'],
	['x', 'х'],
	['p', 'р'],
	['o', 'о'],
	['a', 'а'],
	['e', 'е'],
	['\uff0b', '+'],
	['𝟣', '1'],
	['𝟤', '2'],
	['𝟥', '3'],
	['𝟦', '4'],
	['𝟧', '5'],
	['𝟨', '6'],
	['𝟩', '7'],
	['𝟪', '8'],
	['𝟫', '9'],
	['𝟢', '0'],
  ]);